# Chapter 8 데이터 준비하기: 조인, 병합, 변형

## 8.1 계층적 색인

- pandas의 계층적 색인을 통해 축에 대해 다중 색인 `단계`를 지정할 수 있음
- 높은 차원의 데이터를 낮은 채원의 형식으로 다룰 수 있게 해주는 기능

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.Series(np.random.randn(9),
                 index = [list('aaabbccdd'),
                          [1,2,3,1,3,1,2,2,3]])
data

a  1    1.264037
   2   -0.403840
   3   -0.807954
b  1   -0.531090
   3    1.012241
c  1    0.419572
   2    0.806364
d  2   -1.571278
   3    0.607066
dtype: float64

> 위 객체는 MultiIndex를 색인으로 하는 Series이며 색인의 계층을 보여줌.  
> 바로 위 단계의 색인을 이용해 하위 계층을 직접 접근할 수 있음.

In [3]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

> 계층적으로 색인된 객체는 데이터의 부분집합을 $\text{부분적 색인으로 접근}^{\text{partial indexing}}$ 하는 것이 가능.

In [4]:
data['b']

1   -0.531090
3    1.012241
dtype: float64

In [5]:
data['b':'c']

b  1   -0.531090
   3    1.012241
c  1    0.419572
   2    0.806364
dtype: float64

In [6]:
data.loc[['b','d']]

b  1   -0.531090
   3    1.012241
d  2   -1.571278
   3    0.607066
dtype: float64

> 하위 계층의 객체를 선택하는 것도 가능하다.

In [9]:
data.loc[:, 2]  # 각 알파벳 index 하위 계층의 index 2를 선택

a   -0.403840
c    0.806364
d   -1.571278
dtype: float64

> 계층적 색인은 데이터를 재형성하고 피벗테이블 생성 같은 그룹 기반 작업 시 중요하게 사용됨.  
> 예를 들어 위에서 만든 DataFrame 객체에 unstack 메서드를 사용해 데이터를 새롭게 배열할 수 있음.

In [10]:
data.unstack()

          1         2         3
a  1.264037 -0.403840 -0.807954
b -0.531090       NaN  1.012241
c  0.419572  0.806364       NaN
d       NaN -1.571278  0.607066

> unstack의 반대 작업은 stack 메서드로 수행한다.

In [11]:
data.unstack().stack()

a  1    1.264037
   2   -0.403840
   3   -0.807954
b  1   -0.531090
   3    1.012241
c  1    0.419572
   2    0.806364
d  2   -1.571278
   3    0.607066
dtype: float64

> DataFrame에서는 두 축 모두 계층적 색인을 가질 수 있다.

In [12]:
frame = pd.DataFrame(np.arange(12).reshape((4,3)),
                     index = [['a','a','b','b'],[1,2,1,2]],
                     columns = [['Ohio','Ohio','Colorado'],
                                ['Green','Red','Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

> 계층적 색인의 각 단계는 이름(문자열이나 어떤 파이썬 객체라도 가능)을 가질 수 있고, 만약 이름을 가지고 있다면 콘솔 출력시 함께 나타남.

In [19]:
frame.index.names = ['key1','key2']
frame.columns.names = ['state','color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

> 컬럼 부분집합을 부분적인 색인으로 접근하는 것도 컬럼에 대한 부분적 색인과 비슷하게 사용하면 됨.

In [30]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

### 8.1.1 계층의 순서를 바꾸고 정렬

> 계층적 색인에서 계층의 순서를 바꾸거나 지정된 계층에 따라 데이터를 정렬해야 하는 경우가 있음.  
> swaplevel은 넘겨받은 두 개의 계층 번호나 이름이 뒤바뀐 새로운 객체를 반환함. (하지만 데이터는 변경되지 않음)

In [48]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

> 반면 sort_index 메서드는 단일 계층에 속한 데이터를 정렬.  
> swaplevel을 이용해서 계층을 바꿀 대 sort_index를 사용해서 결과가 사전적으로 정렬되도록 만드는 것도 드물지 않은 일.

In [49]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [53]:
frame.swaplevel(0,1)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [51]:
frame.swaplevel(0,1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

### 8.1.2 계층별 요약 통계

> DataFrame과 Series의 많은 기술 통계와 요약 통계는 level 옵션을 가지고 있음.  
> 앞에서 살펴본 DataFrame에서 로우나 컬럼을 아래처럼 계층별로 합할 수 있다.

In [58]:
frame.sum(level = "key2")

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [60]:
frame.sum(level = "color", axis = 1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### 8.1.3 DataFrame의 컬럼 사용하기

> DataFrame에서 로우를 선택하기 위한 색인으로 하나 이상의 컬럼을 사용하는 것은 드물지 않다.  
> 혹은 로우의 색인을 DataFrame의 컬럼으로 옮길 수도 있다.

In [63]:
frame = pd.DataFrame({"a" : range(7),
                      "b" : range(7,0,-1),
                      "c" : ["one",'one','one','two','two','two','two'],
                      "d" : [0,1,2,0,1,2,3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

> DataFrame의 set_index 함수는 하나 이상의 컬럼을 색인으로 하는 새로운 DataFrame을 생성.

In [65]:
frame2 = frame.set_index(['c','d'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

> 다음처럼 컬럼을 명시적으로 남겨두지 않으면 DataFrame에서 삭제된다.

In [66]:
frame.set_index(['c','d'], drop = False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

> 반면 reset_index 함수는 set_index와 반대되는 개념인데 계층적 색인 단계가 컬럼으로 이동함.

In [67]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

## 8.2 데이터 합치기

pandas 객체에 저장된 데이터는 여러 가지 방법으로 합칠 수 있다.
- pandas.merge는 하나 이상의 키를 기준으로 DataFrame의 로우를 합친다. SQL이나 다른 관계형 데이터 베이스의 join 연산과 유사함.
    - pandas.join() 은 색인을 기준으로 병합 시 유용하게 사용 가능함. 특히 여러 개의 데이터 프레임을 리스트로 받아서 합침.
- pandas.concat은 하나의 축을 따라 객체를 이어붙임.
- combile_first 인스턴스 메서드는 두 객체를 포개서 한 객체에서 누락된 데이터를 다른 객체에 있는 값으로 채울 수 있도록 함.

### 8.2.1 데이터베이스 스타일로 DataFrame 합치기

- `병합`이나 `조인`연산은 관계형 데이터베이스의 핵심적인 연산.
- 하나 이상의 `키`를 사용해서 데이터 집합의 로우를 합침.

In [3]:
df1 = pd.DataFrame({"key" : list('bbacaab'),
                    "data1" : range(7)})
df2 = pd.DataFrame({"key" : list('abd'),
                    "data2" : range(3)})

In [4]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [5]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

> 본 예제는 `다대일`의 경우임  
> df1의 데이터는 key 컬럼에 여러 개의 a,b로우를 가지고 있고 df2의 데이터는 key 컬럼에 유일한 로우를 가지고 있음.

In [6]:
pd.merge(df1,df2,on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

> 만약 두 객체에 중복된 컬럼 이름이 하나도 없다면 따로 지정해주면 됨

In [7]:
df3 = pd.DataFrame({'lkey' : list('bbacaab'),
                    'data1' : range(7)})
df4 = pd.DataFrame({'rkey' : list('abd'),
                    'data2' : range(3)})

pd.merge(df3, df4, left_on = 'lkey', right_on = 'rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

> merge 함수는 기본적으로 $\text{내부조인}^{\text{inner join}}$ 을 수행하여 교집합인 결과를 반환하므로 'c'와 'd'에 해당하는 값이 빠진 것을 알 수 있음  
> how 인자로 'left', 'right', 'outer'를 넘겨서 각각 왼쪽 조인, 오른쪽 조인, 외부 조인을 수행할 수도 있음.  
> 외부 조인은 합집합, 왼쪽 조인과 오른쪽 조인은 각각 왼쪽 또는 오른쪽의 모든 로우를 포함하는 결과를 반환

In [8]:
pd.merge(df1, df2, how = 'outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

#### how 옵션에 따른 다양한 조인 연산

<details>
<summary>how 옵션에 따른 다양한 조인 연산</summary>
<div markdown="1">

|옵션|동작|
|:--|:--|
|'inner'|양쪽 테이블 모두에 존재하는 키 조합을 사용|
|'left'|왼쪽 테이블에 존재하는 모든 키 조합을 사용|
|'right'|오른쪽 테이블에 존재하는 모든 키 조합을 사용|
|'output'|양쪽 테이블에 존재하는 모든 키 조합을 사용|
    
</div>
</details>

> `다대다` 병합은 잘 정의되어 있긴 하지만 직관적이지는 않음.  
> 다대다 조인은 두 로우의 데카르트 곱을 반환함.  
> 왼쪽 DataFrame에는 3개의 'b' 로우가 있고 오른쪽에는 2개의 'b' 로우가 있으며 결과는 6개의 'b' 로우가 됨.

In [10]:
df1 = pd.DataFrame({'key' : list('bbacab'),
                    'data1' : range(6)})
df2 = pd.DataFrame({'key' : list('ababd'), 
                    'data2' : range(5)})

In [13]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [14]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [17]:
pd.merge(df1, df2, on = "key", how = "inner")

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   b      5      1
5   b      5      3
6   a      2      0
7   a      2      2
8   a      4      0
9   a      4      2

> 여러 개의 키를 병합하려면 컬럼 이름이 담긴 리스트를 넘기면 됨.

In [4]:
left = pd.DataFrame({'key1' : ['foo','foo','bar'],
                     'key2' : ['one','two','one'],
                     'lval' : [1,2,3]})
right = pd.DataFrame({'key1' : ['foo','foo','bar','bar'],
                      'key2' : ['one','one','one','two'],
                      'rval' : [4,5,6,7]})

pd.merge(left, right, on = ['key1','key2'], how = 'outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

> 병합 연산에서 고려해야 할 마지막 사항은 겹치는 컬럼 이름에 대한 처리.  
> 축 이름을 변경해서 수동으로 컬럼 이름이 겹치게 할 수도 있음.  
> merge 함수에 있는 suffixes 인자로 두 DataFrame 객체에서 겹치는 컬럼 이름 뒤에 붙일 문자열을 지정해줄 수도 있음.

In [5]:
pd.merge(left, right, on = 'key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [6]:
pd.merge(left, right, on = 'key1', suffixes = ("_left","_right"))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

#### merge 함수 인자 목록

<details>
<summary>merge 함수 인자 목록</summary>
<div markdown="1">

|인자|설명|
|:--|:--|
|left|병합하려는 DataFrame 중 왼쪽에 위치한 DataFrame|
|right|병합하려는 DataFrame 중 오른쪽에 위치한 DataFrame|
|how|조인 방법. 'inner', 'outer', 'left', 'right'. 기본값은 'inner'|
|on|조인하려는 컬럼 이름. 반드시 두 DataFrame 객체 모두에 존재하는 이름이어야 함. 만약 명시되지 않고 다른 조인키도 주어지지 않으면 left와 right에서 공통되는 컬럼을 조인키로 사용.|
|left_on|조인키로 사용할 left DataFrame의 컬럼|
|right_on|조인키로 사용할 right DataFrame의 컬럼|
|left_index|조인키로 사용할 left DataFrame의 색인 로우(다중 색인일 경우 키)|
|right_index|조인키로 사용할 rigth DataFrame의 색인 로우(다중 색인일 경우 키)|
|sort|조인키에 따라 병합된 데이터를 사전순으로 정렬. 기본값은 True. 대용량 데이터의 경우 False로 하면 성능상의 이득을 얻을 수 있다.|
|suffixes|컬럼 이름이 겹칠 경우 각 컬럼 이름 뒤에 붙일 문자열의 튜플. 기본값은 ('_x','_y').|
|copy|False일 경우, 예외적인 경우에 데이터가 결과로 복사되지 않도록 한다. 기본값은 항상 복사가 이루어진다.|
|indicator|merge라는 이름의 특별한 컬럼을 추가하여 각 `로우의 소스`가 어디인지 나타낸다. 'left_only', 'right_only', 'both'값을 가진다.|

    
</div>
</details>

### 8.2.2 색인 병합하기

> 병합하려는 키가 DataFrame의 색인일 경우가 있음.  
> 이런 경우에는 left_index = True 혹은 right_index = True 옵션 (또는 둘 다)을 지정해서 해당 색인을 병합키로 사용할 수 있음.

In [10]:
left1 = pd.DataFrame({'key' : list('abaabc'),
                      'value' : range(6)})
right1 = pd.DataFrame({'group_val' : [3.5, 7]}, index = list('ab'))

In [11]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [12]:
right1

   group_val
a        3.5
b        7.0

In [17]:
pd.merge(left1, right1, left_on = 'key', right_index = True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

> 병합은 기본적으로 교집합을 구함.  
> 외부 조인을 실행해서 합집합을 구할 수도 있음.

In [18]:
pd.merge(left1, right1, left_on = "key", right_index = True, how = "outer")

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

> 계층 색인된 데이터는 암묵적으로 여러 키를 병합하는 것이라 약간 복잡함.

In [22]:
lefth = pd.DataFrame({'key1' : ['Ohio','Ohio','Ohio','Nevada','Nevada'],
                      'key2' : [2000,2001,2002,2001,2002],
                      'data' : np.arange(5.)})
righth = pd.DataFrame(np.arange(12).reshape((6,2)),
                      index = [['Nevada','Nevada','Ohio','Ohio','Ohio','Ohio'],
                               [2001,2000,2000,2000,2001,2002]],
                      columns = ['event1','event2'])

In [23]:
lefth

     key1  key2  data
0    Ohio  2000   0.0
1    Ohio  2001   1.0
2    Ohio  2002   2.0
3  Nevada  2001   3.0
4  Nevada  2002   4.0

In [24]:
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

> 이 경우에는 리스트로 여러 개의 컬럼을 지정해서 병합해야 함. (중복되는 색인값을 다룰 때는 how = 'outer' 옵션을 사용해야 함.)

In [25]:
pd.merge(lefth, righth, left_on = ['key1','key2'], right_index = True, how = 'outer')

     key1  key2  data  event1  event2
0    Ohio  2000   0.0     4.0     5.0
0    Ohio  2000   0.0     6.0     7.0
1    Ohio  2001   1.0     8.0     9.0
2    Ohio  2002   2.0    10.0    11.0
3  Nevada  2001   3.0     0.0     1.0
4  Nevada  2002   4.0     NaN     NaN
4  Nevada  2000   NaN     2.0     3.0

> 양쪽에 공통적으로 존재하는 여러 개의 색인을 병합하는 것도 가능함.

In [41]:
left2 = pd.DataFrame(np.arange(1.0,7.0).reshape((3,2)),
                     index = list('ace'),
                     columns = ['Ohio', 'Nevada'])
right2 = pd.DataFrame(np.arange(7.0,15.0).reshape((4,2)),
                      index = list('bcde'),
                      columns = ['Missouri', 'Alabama'])

In [42]:
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [43]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [44]:
pd.merge(left2, right2, how = 'outer', left_index = True, right_index = True)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

> 색인으로 병합 시 DataFrame의 join 메서드를 사용하면 편리함.  
> join 메서드는 컬럼이 겹치지 않으며 완전히 같거나 유사한 색인 구조를 가진 여러 개의 DataFrame객체를 병합할 때 사용할 수 있음.

In [45]:
left2.join(right2, how = 'outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

> 과거에 작성된 pandas의 일부 코드 제약으로 인해 DataFrame의 join 메서드는 왼쪽 조인을 수행함.  
> join 메서드를 호출한 DataFrame의 컬럼 중 하나에 대해 조인을 수행하는 것도 가능함.

In [49]:
left1.join(right1, on = 'key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

> 마지막으로 색인 대 색인 두 DataFrame을 병합하려면 간단히 병합하려는 DataFrame의 리스트를 join 메서드로 넘기면 됨.  
> 하지만 보통 이런 병합은 아래에서 살펴볼 concat 메서드를 사용.

In [52]:
another = pd.DataFrame(np.arange(7.,15.).reshape((4,2)),
                       index = list('acef'),
                       columns = ['New York', 'Oregon'])

In [53]:
another

   New York  Oregon
a       7.0     8.0
c       9.0    10.0
e      11.0    12.0
f      13.0    14.0

In [55]:
left2.join([right2,another], how = "outer")

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0
b   NaN     NaN       7.0      8.0       NaN     NaN
d   NaN     NaN      11.0     12.0       NaN     NaN
f   NaN     NaN       NaN      NaN      13.0    14.0

### 8.2.3 축 따라 이어붙이기

> 데이터를 합치는 또 다른 방법으로 이어붙이기 (연결, 적층 이라고도 한다)가 있음.  
> Numpy는 ndarray를 이어 붙이는 concatenate함수를 제공함.

In [56]:
arr = np.arange(12).reshape((3,4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [59]:
np.concatenate([arr,arr], axis = 1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

> Series나 DataFrame 같은 pandas 객체의 컨텍스트 내부에는 축마다 이름이 있어 배열을 쉽게 이어붙일 수 있도록 되어 있음. 이 때 다음 사항을 고려해야 함.  
> - 만약 연결하려는 두 객체의 색인이 서로 다르면 결과는 그 색인의 교집합이어야 하는가 아니면 합집합이어야 하는가?
> - 합쳐진 결과에서 합쳐지기 전 객체의 데이터를 구분할 수 있어야 하는가?
> - 어떤 축으로 연결할 것인지 고려해야 하는가? 많은 경우 DataFrame의 기본 정수 라벨이 가장 먼저 무시됨.  

> pandas의 concat함수는 위 사항에 대한 답을 제공함.

In [61]:
s1 = pd.Series([0,1], index = list('ab'))
s2 = pd.Series([2,3,4], index = list('cde'))
s3 = pd.Series([5,6], index = list('fg'))

> 위 세 객체를 리스트로 묶어서 concat함수에 전달하면 값과 색인을 연결해 줌.

In [62]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

> concat 함수는 axis = 0 을 기본값으로 하여 새로운 Series 객체를 생성.  
> 만약 axis = 1을 넘긴다면 결과는 Series가 아니라 DataFrame이 될 것. (axis = 1은 컬럼을 의미.)

In [63]:
pd.concat([s1,s2,s3], axis = 1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

> 겹치는 축이 없기 때문에 외부 조인으로 정렬된 합집합을 얻음.  
> join = 'inner'를 넘겨 교집합을 구할 수도 있음.

In [64]:
s4 = pd.concat([s1,s3])
s4

a    0
b    1
f    5
g    6
dtype: int64

In [65]:
pd.concat([s1,s4], axis =1, join = 'inner')

   0  1
a  0  0
b  1  1

> reindex를 활용하여 병합하려는 축을 직접 지정해줄 수도 있다.

In [71]:
pd.concat([s1,s4], axis =1).reindex(list('acbe'))

     0    1
a  0.0  0.0
c  NaN  NaN
b  1.0  1.0
e  NaN  NaN

> 이어붙인 축에 대해 계층적 색인을 생성하여 식별이 가능하도록 할 수 있음.  
> 계층적 색인을 생성하려면 keys 인자를 사용하면 됨.

In [75]:
result = pd.concat([s1,s1,s3], keys = ['one','two','three'])
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [76]:
result.unstack()

         a    b    f    g
one    0.0  1.0  NaN  NaN
two    0.0  1.0  NaN  NaN
three  NaN  NaN  5.0  6.0

> Series를 axis = 1로 병합할 경우 keys는 DataFrame의 컬럼 제목이 됨.

In [77]:
pd.concat([s1,s2,s3], axis = 1, keys = ['one','two','three'])

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

> DataFrame 객체에 대해서도 지금까지와 같은 방식으로 적용할 수 있음.

In [82]:
df1 = pd.DataFrame(np.arange(6).reshape((3,2)),
                   index = list('abc'),
                   columns = ['one', 'two'])

df2 = pd.DataFrame(5 + np.arange(4).reshape((2,2)), 
                   index = list('ac'),
                   columns = ['three', 'four'])

In [83]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [84]:
df2

   three  four
a      5     6
c      7     8

In [85]:
pd.concat([df1,df2], 
          axis = 1,
          keys = ['level1','level2'])

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

> 리스트 대신 객체의 사전을 넘기면 사전의 키가 keys 옵션으로 사용됨.

In [86]:
pd.concat({'level1' : df1,
           'level2' : df2}, axis = 1)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

> 새로 생성된 계층의 이름은 names 인자로 지정할 수 있음.

In [87]:
pd.concat([df1,df2], axis = 1, keys = ['level1','level2'],
          names = ['upper','lower'])

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

> DataFrame의 로우 색인이 분석에 필요한 데이터를 포함하고 있지 않은 경우.  
> ignore_index = True 옵션을 주면 됨.

In [89]:
df1 = pd.DataFrame(np.random.randn(3,4), columns = list('abcd'))
df2 = pd.DataFrame(np.random.randn(2,3), columns = list('bda'))

In [90]:
df1

          a         b         c         d
0  0.152658 -0.251977  1.129989  1.541007
1  0.948292 -0.335963 -0.216536 -0.242088
2 -0.103935  0.174221 -1.901351 -0.098472

In [91]:
df2

          b         d         a
0 -0.958934 -0.985587 -1.277412
1  0.131110  0.709922  0.352151

In [92]:
pd.concat([df1,df2], ignore_index = True)

          a         b         c         d
0  0.152658 -0.251977  1.129989  1.541007
1  0.948292 -0.335963 -0.216536 -0.242088
2 -0.103935  0.174221 -1.901351 -0.098472
3 -1.277412 -0.958934       NaN -0.985587
4  0.352151  0.131110       NaN  0.709922

#### concat 함수 인자

<details>
<summary>concat 함수 인자 목록</summary>
<div markdown="1">

|인자|설명|
|:--|:--|
|objs|이어붙일 pandas 객체의 사전이나 리스트. 필수 인자|
|axis|이어붙일 축 방향. 기본값은 0|
|join|조인 방식. 'inner' (내부 조인, 교집합)과 'outer' (외부조인, 합집합)가 있으며 기본값은 'outer'|
|keys|이어붙일 객체나 이어붙인 축에 대한 계층 색인을 생성하는 데 연관된 값이다. 리스트나 임의의 값이 들어 있는 배열, 튜플의 배열 또는 배열의 리스트 (levels 옵션에 다차원 배열이 넘어온 경우)가 될 수 있다.|
|names|keys나 levels 혹은 둘 다 있을 경우 생성된 계층 레벨을 위한 이름|
|verify_integrity|이어붙인 객체에 중복되는 축이 있는지 검사하고 있다면 예외를 발생시킨다. 기본값은 False로, 중복을 허용함.|
|ignore_index|이어붙인 축의 색인을 유지하지 않고 range(total_length)로 새로운 색인을 생성함.|
    
</div>
</details>

### 8.2.4 겹치는 데이터 합치기

> 두 데이터셋의 색인이 일부 겹치거나 전체가 겹치는 경우, 병합이나 이어붙이기가 불가능한 상황이 된다.  
> 벡터화된 if-else 구문을 표현하는 NumPy의 where 함수로 자세히 알아보자.

In [94]:
a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],
              index = list('fedcba'))
b = pd.Series(np.arange(len(a), dtype = np.float64),
              index = list('fedcba'))
b[-1] = np.nan

In [95]:
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [96]:
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    NaN
dtype: float64

In [100]:
np.where(pd.isnull(a), b, a)

array([0. , 2.5, 2. , 3.5, 4.5, nan])

> Series 객체의 combine_first 메서드는 위와 동일한 연산을 제공하며 데이터 정렬 기능까지 제공함.

In [106]:
a.combine_first(b)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    NaN
dtype: float64

> DataFrame에서 combine_first 메서드는 컬럼에 대해 같은 동작을 함.  
> 그러므로 호출하는 객체에서 누락된 데이터를 인자로 넘긴 객체에 있는 값으로 채워 넣을 수 있음.

In [108]:
df1 = pd.DataFrame({'a' : [1., np.nan, 5., np.nan],
                    'b' : [np.nan, 2., np.nan, 6.],
                    'c' : range(2,18,4)})
df2 = pd.DataFrame({'a' : [5., 4., np.nan, 3., 7.],
                    'b' : [np.nan, 3., 4., 6., 8.]})

In [109]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [110]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [111]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

## 8.3 재형성과 피벗

- 표 형식의 데이터를 재배치하는 다양한 기본연산이 존재함. 이런 연산을 `재형성` 또는 `피벗` 연산이라고 함.

### 8.3.1 계층적 색인으로 재형성하기

- stack 
    - 데이터의 컬럼을 로우로 피벗(또는 회전)시킨다.
- unstack
    - 로우를 컬럼으로 피벗시킴.

In [113]:
data = pd.DataFrame(np.arange(6).reshape((2,3)), 
                    index = pd.Index(['Ohio', 'Colorado'], name = 'state'),
                    columns = pd.Index(['one', 'two', 'three'], name = 'number'))
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

> stack 메서드를 사용하면 컬럼이 로우로 피벗되어서 다음과 같은 Series 객체를 반환함.

In [114]:
result = data.stack()
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

> unstack 메서드를 사용하면 위 계층적 색인을 가진 Series로부터 다시 DataFrame을 얻을 수 있음.

In [115]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

> stack/unstack은 기본적으로 가장 안쪽에 있는 레벨부터 끄집어 냄.  
> 레벨 숫자나 이름을 전달해 끄집어낼 단계를 지정할 수 있음.

In [116]:
result.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [118]:
result.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

> 해당 레벨에 있는 모든 값이 하위그룹에 속하지 않을 경우 unstack을 하게 되면 누락된 데이터가 생길 수 있음.

In [121]:
s1 = pd.Series([0,1,2,3], index = list('abcd'))
s2 = pd.Series([4,5,6], index = list('cde'))
data2 = pd.concat([s1,s2], keys = ['one','two'])
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [123]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

> stack 메서드는 누락된 데이터를 자동으로 걸러내기 때문에 연산을 쉽게 원상 복구할 수 있음.

In [124]:
data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [125]:
data2.unstack().stack(dropna = False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

> DataFrame을 unstack() 할 때 unstack 레벨은 결과에서 가장 낮은 단계가 됨.

In [129]:
df = pd.DataFrame({'left' : result, 
                   'right' : result + 5}, 
                  columns = pd.Index(['left','right'], name = 'side'))
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [130]:
df.unstack('state')

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

> stack을 호출할 때 쌓을 축의 이름을 지정할 수 있음.

In [132]:
df.unstack('state').stack('side')

state         Colorado  Ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7

### 8.3.2 긴 형식에서 넓은 형식으로 피벗하기

- 데이터베이스나 CSV 파일에 여러 개의 시계열 데이터를 저장하는 일반적인 방법은 시간 순서대로 나열하는 것.

In [182]:
data = pd.read_csv('examples/macrodata.csv')
data.head()

,year,quarter,realgdp,realcons,realinv,realgovt,realdpi,cpi,m1,tbilrate,unemp,pop,infl,realint
0,1959.0,1.0,2710.349,1707.4,286.898,470.045,1886.9,28.98,139.7,2.82,5.8,177.146,0.00,0.00
1,1959.0,2.0,2778.801,1733.7,310.859,481.301,1919.7,29.15,141.7,3.08,5.1,177.830,2.34,0.74
2,1959.0,3.0,2775.488,1751.8,289.226,491.260,1916.4,29.35,140.5,3.82,5.3,178.657,2.74,1.09
3,1959.0,4.0,2785.204,1753.7,299.356,484.052,1931.3,29.37,140.0,4.33,5.6,179.386,0.27,4.06
4,1960.0,1.0,2847.699,1770.5,331.722,462.199,1955.5,29.54,139.6,3.50,5.2,180.007,2.31,1.19

In [183]:
periods = pd.PeriodIndex(year = data.year,
                         quarter = data.quarter, 
                         name = 'date')

columns = pd.Index(['realgdp', 'infl', 'unemp'],
                    name = 'item')

data = data.reindex(columns = columns)

data.index = periods.to_timestamp('D','end')

ldata = data.stack().reset_index().rename(columns = {0: 'value'})

In [184]:
ldata[:10]

                           date     item     value
0 1959-03-31 23:59:59.999999999  realgdp  2710.349
1 1959-03-31 23:59:59.999999999     infl     0.000
2 1959-03-31 23:59:59.999999999    unemp     5.800
3 1959-06-30 23:59:59.999999999  realgdp  2778.801
4 1959-06-30 23:59:59.999999999     infl     2.340
5 1959-06-30 23:59:59.999999999    unemp     5.100
6 1959-09-30 23:59:59.999999999  realgdp  2775.488
7 1959-09-30 23:59:59.999999999     infl     2.740
8 1959-09-30 23:59:59.999999999    unemp     5.300
9 1959-12-31 23:59:59.999999999  realgdp  2785.204

> 위는 `긴 형식`이라고 부르며, 여러 시계열이나 둘 이상의 키 (예제에서는 date와 time)를 가지고 있는 다른 관측 데이터에서 사용함.  
> 각 로우는 단일 관측치를 나타냄. 
> 길이가 긴 형식으로는 작업이 용이하지 않을 수 있어 하나의 DataFrame에 data 컬럼의 시간값으로 색인된 개별 item을 컬럼으로 포함시키는 것이 더 선호될 수 있다.  
> DataFrame의 pivot 메서드가 이런 변형을 지원함.

In [186]:
pivoted = ldata.pivot('date', 'item', 'value')
pivoted

item                           infl    realgdp  unemp
date
1959-03-31 23:59:59.999999999  0.00   2710.349    5.8
1959-06-30 23:59:59.999999999  2.34   2778.801    5.1
1959-09-30 23:59:59.999999999  2.74   2775.488    5.3
1959-12-31 23:59:59.999999999  0.27   2785.204    5.6
1960-03-31 23:59:59.999999999  2.31   2847.699    5.2
...                             ...        ...    ...
2008-09-30 23:59:59.999999999 -3.16  13324.600    6.0
2008-12-31 23:59:59.999999999 -8.79  13141.920    6.9
2009-03-31 23:59:59.999999999  0.94  12925.410    8.1
2009-06-30 23:59:59.999999999  3.37  12901.504    9.2
2009-09-30 23:59:59.999999999  3.56  12990.341    9.6

[203 rows x 3 columns]

> pivot 메서드의 처음 두 인자는 로우와 컬럼 색인으로 사용될 컬럼 이름이고 마지막 인자들은 DataFrame에 채워 넣을 값을 담고 있는 컬럼 이름.

In [197]:
ldata['value2'] = np.random.randn(len(ldata))
ldata[:10]

                           date     item     value    value2
0 1959-03-31 23:59:59.999999999  realgdp  2710.349  0.466429
1 1959-03-31 23:59:59.999999999     infl     0.000  0.470312
2 1959-03-31 23:59:59.999999999    unemp     5.800  0.744191
3 1959-06-30 23:59:59.999999999  realgdp  2778.801 -1.547745
4 1959-06-30 23:59:59.999999999     infl     2.340  0.840425
5 1959-06-30 23:59:59.999999999    unemp     5.100 -1.443233
6 1959-09-30 23:59:59.999999999  realgdp  2775.488 -0.724164
7 1959-09-30 23:59:59.999999999     infl     2.740 -0.181860
8 1959-09-30 23:59:59.999999999    unemp     5.300  0.517620
9 1959-12-31 23:59:59.999999999  realgdp  2785.204 -0.643711

> 마지막 인자를 생략해서 계층적 컬럼을 가지는 DataFrame을 얻을 수 있음.

In [203]:
pivoted = ldata.pivot('date','item')
pivoted[:5]

                              value                    value2            \
item                           infl   realgdp unemp      infl   realgdp
date
1959-03-31 23:59:59.999999999  0.00  2710.349   5.8  0.470312  0.466429
1959-06-30 23:59:59.999999999  2.34  2778.801   5.1  0.840425 -1.547745
1959-09-30 23:59:59.999999999  2.74  2775.488   5.3 -0.181860 -0.724164
1959-12-31 23:59:59.999999999  0.27  2785.204   5.6 -0.648133 -0.643711
1960-03-31 23:59:59.999999999  2.31  2847.699   5.2 -0.742529 -0.791635


item                              unemp
date
1959-03-31 23:59:59.999999999  0.744191
1959-06-30 23:59:59.999999999 -1.443233
1959-09-30 23:59:59.999999999  0.517620
1959-12-31 23:59:59.999999999 -0.354503
1960-03-31 23:59:59.999999999 -1.116380

In [204]:
pivoted['value'][:5]

item                           infl   realgdp  unemp
date
1959-03-31 23:59:59.999999999  0.00  2710.349    5.8
1959-06-30 23:59:59.999999999  2.34  2778.801    5.1
1959-09-30 23:59:59.999999999  2.74  2775.488    5.3
1959-12-31 23:59:59.999999999  0.27  2785.204    5.6
1960-03-31 23:59:59.999999999  2.31  2847.699    5.2

> pivot은 단지 set_index를 사용해 계층적 색인을 만들고 unstack 메서드를 이용해 형태를 변경하는 단축키 같은 메서드임.

In [208]:
unstacked = ldata.set_index(['date','item']).unstack('item')
unstacked[:7]

                              value                    value2            \
item                           infl   realgdp unemp      infl   realgdp
date
1959-03-31 23:59:59.999999999  0.00  2710.349   5.8  0.470312  0.466429
1959-06-30 23:59:59.999999999  2.34  2778.801   5.1  0.840425 -1.547745
1959-09-30 23:59:59.999999999  2.74  2775.488   5.3 -0.181860 -0.724164
1959-12-31 23:59:59.999999999  0.27  2785.204   5.6 -0.648133 -0.643711
1960-03-31 23:59:59.999999999  2.31  2847.699   5.2 -0.742529 -0.791635
1960-06-30 23:59:59.999999999  0.14  2834.390   5.2 -0.207938 -0.059220
1960-09-30 23:59:59.999999999  2.70  2839.022   5.6  0.571006  0.851155


item                              unemp
date
1959-03-31 23:59:59.999999999  0.744191
1959-06-30 23:59:59.999999999 -1.443233
1959-09-30 23:59:59.999999999  0.517620
1959-12-31 23:59:59.999999999 -0.354503
1960-03-31 23:59:59.999999999 -1.116380
1960-06-30 23:59:59.999999999  0.900213
1960-09-30 23:59:59.999999999  0.516522

### 8.3.3 넓은 형식에서 긴 형식으로 피벗하기

- pivot과 반대되는 연산은 pandas.melt. 
- 하나의 컬럼을 여러 개의 새로운 DataFrame으로 생성하기보다는 여러 컬럼을 하나로 병합하고 DataFrame을 입력보다 긴 형태로 만들어 냄.

In [209]:
df = pd.DataFrame({'key' : ['foo', 'bar', 'baz'],
                   'A' : [1,2,3],
                   'B' : [4,5,6],
                   'C' : [7,8,9]}) 
df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

> 'key' 컬럼을 그룹 구분자로 사용할 수 있고 다른 컬럼을 데이터값으로 사용할 수 있음.  
> pandas.melt를 사용할 때는 반드시 어떤 컬럼을 그룹 구분자로 사용할 것인지 지정해야 함.

In [211]:
melted = pd.melt(df, ['key'])
melted

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9

> pivot을 사용해 원래 모양으로 되돌릴 수 있음.

In [214]:
reshaped = melted.pivot('key', 'variable', 'value')
reshaped

variable  A  B  C
key
bar       2  5  8
baz       3  6  9
foo       1  4  7

> pivot의 결과는 로우 라벨로 사용하던 컬럼에서 색인을 생성하므로 reset_index를 이용해 데이터를 다시 컬럼으로 돌려놓자.

In [216]:
reshaped.reset_index()

variable  key  A  B  C
0         bar  2  5  8
1         baz  3  6  9
2         foo  1  4  7

> 데이터값을 사용할 컬럼들의 집합을 지정할 수도 있음.

In [219]:
pd.melt(df, id_vars = ['key'], value_vars = ['A','B'])

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6

> pandas.melt는 그룹  구분자 없이도 사용할 수 있음.

In [222]:
pd.melt(df, value_vars = ['A','B','C'])

  variable  value
0        A      1
1        A      2
2        A      3
3        B      4
4        B      5
5        B      6
6        C      7
7        C      8
8        C      9

In [223]:
pd.melt(df, value_vars = ['key','A','B'])

  variable value
0      key   foo
1      key   bar
2      key   baz
3        A     1
4        A     2
5        A     3
6        B     4
7        B     5
8        B     6